In [1]:
==================Data Analysis===================
1.pandas     :   Data frame analysis
2.Numpy      :   Numerical analysis
3.matplotlib :   Graphs and plots
4.seaborn    :   plots
5.Bokhe      :   plots
6.plotly     :   plots

===============Machine Learning==================
7.Stats                :   for statistical models
8.Scikit-learn(sklearn) :  ML models

==============Deep learning======================
9.opencv      :   computer vision
10.pillow     :   Image operations
11.tensorflow :   Neural Network creations(developed by google)
12.keras      :   NN
13.pytorch    :  alternative package of tensorflow(facebook meta)

===============NLP=================================
14. NLTK       :  Natural language toolkit
15.Spacy       :  Alternative

===============Scarapping===========
17.Sqlite  :   Data base creation
18.

=============API creations==========
20.Flask
21.FastAPI
22.Gradio
23.Django
=============UI 

==============Transfer learning models(Dl)============
25.Mobilenet
26.Resnet
27.VGGnet
28.Inception
29.Yolo: Ultralytics

===============Transfer Learning models(NLP)==========
30.Word2vec
31.Glove

=================Huging Face Transformers================
32.BERT : Bi Directional Encoder representation of Transformers
=================Allen NlP===============
33.Allen NLP packages
===============GenAI===============
34.Langchain
35.Google Gemini related packages
36.openAI GPT related packages
37.Amazon BedRock related packages
38.Meta Llama related packages

=====================Image and Video Generations===========
39.GAN models related packages
40.SORA related packages
=====================Cloud appilications==================
43.Azure ML related pacckages
44.GCP VertexAI related packages
45.AWS Sagemaker related packages
======================Small============================
46.time
47.logging
48.math
49.random
50.env
51.0s

SyntaxError: invalid decimal literal (2370603651.py, line 2)

**step-1 Import packages**

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

**step-2: create a Dataframe using list**
- data  : your data either list or dict
- index : we need to provide a list
- column : we need to provide a list

In [4]:
names=['Ramesh','Suresh','Satish']
pd.DataFrame(names)

        0
0  Ramesh
1  Suresh
2  Satish

In [5]:
names=['Ramesh','Suresh','Satish']
pd.DataFrame(names,
             columns=['Names'])

    Names
0  Ramesh
1  Suresh
2  Satish

**step-3: Change the index**

In [6]:
names=['Ramesh','Suresh','Satish']
pd.DataFrame(names,
             index=['A','B','C'],
             columns=['Names'])

    Names
A  Ramesh
B  Suresh
C  Satish

In [7]:
names=['Ramesh','Suresh','Satish']
idx=['A','B','C']
cols=['Names']
pd.DataFrame(names,
             index=['A','B','C'],
             columns=['Names'])

    Names
A  Ramesh
B  Suresh
C  Satish

**step-4:Add the multiple columns**

In [8]:
names=['Ramesh','Suresh','Satish']
age=[20,22,24]
pd.DataFrame(zip(names,age),
             columns=['Names','Age'])

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Satish   24

**step-5: create empty dataframe and update the columns**

In [9]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Satish']
df

    Names
0  Ramesh
1  Suresh
2  Satish

In [10]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Satish']
df['Age']=[20,22,24]
df

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Satish   24

**step-6: Add a new column with existing dataframe**

In [11]:
names=['Ramesh','Suresh','Satish']
age=[20,22,24]
pd.DataFrame(zip(names,age),
             columns=['Names','Age'])
df

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Satish   24

In [12]:
names=['Ramesh','Suresh','Satish']
age=[20,22,24]
pd.DataFrame(zip(names,age),
             columns=['Names','Age'])
df['city']=['Hyd','Pune','Blr']
df

    Names  Age  city
0  Ramesh   20   Hyd
1  Suresh   22  Pune
2  Satish   24   Blr

**step-7: overwrite the columns values**
- I want to overwrite my age values
- originally age is =[20,22,24]
- now i want to update the age =[30,32,34]

In [13]:
df

    Names  Age  city
0  Ramesh   20   Hyd
1  Suresh   22  Pune
2  Satish   24   Blr

In [14]:
df['Age']=[30,32,34]
df

    Names  Age  city
0  Ramesh   30   Hyd
1  Suresh   32  Pune
2  Satish   34   Blr

In [15]:
df['Age']=[30,32,34]
df['age']=[30,32,34]
df

    Names  Age  city  age
0  Ramesh   30   Hyd   30
1  Suresh   32  Pune   32
2  Satish   34   Blr   34

**step-8: Drop the column**
- labels
- axis
- index
- columns
- inplace

In [16]:
df.drop('age') #error
# here python assume age is label
#python asks qn: it is index label or column label
# axis=1 means for columns
#axis=0 means for rows
#by default axis=0

KeyError: "['age'] not found in axis"

In [ ]:
df.drop('age',axis=0) #error

In [ ]:
df.drop('age',axis=1)

In [ ]:
df # we are able to see old column
# because we did not apply inplace=True

In [ ]:
df.drop(columns=['age'])

In [ ]:
df.drop(columns=['age'], # whenever we use columns label
        inplace=True)

In [17]:
df

    Names  Age  city  age
0  Ramesh   30   Hyd   30
1  Suresh   32  Pune   32
2  Satish   34   Blr   34

In [18]:
df.drop(2,
        axis=0)

    Names  Age  city  age
0  Ramesh   30   Hyd   30
1  Suresh   32  Pune   32

In [19]:
df.drop(index=2)

    Names  Age  city  age
0  Ramesh   30   Hyd   30
1  Suresh   32  Pune   32

**step-9: rename the column**
- mapper:dictionary{'city':'city'}
- index
- columns:'city'
- axis
- copy
- inplace

In [20]:
df

    Names  Age  city  age
0  Ramesh   30   Hyd   30
1  Suresh   32  Pune   32
2  Satish   34   Blr   34

In [21]:
dict1={'City':'city'}
df.rename(columns=dict1,
          inplace=True)
df

    Names  Age  city  age
0  Ramesh   30   Hyd   30
1  Suresh   32  Pune   32
2  Satish   34   Blr   34

In [22]:
dict1={'city':'city'}
df.rename(dict1)

    Names  Age  city  age
0  Ramesh   30   Hyd   30
1  Suresh   32  Pune   32
2  Satish   34   Blr   34

In [23]:
dict1={2:'B'}
df.rename(index=dict1)

    Names  Age  city  age
0  Ramesh   30   Hyd   30
1  Suresh   32  Pune   32
B  Satish   34   Blr   34

In [24]:
df1=pd.DataFrame()
df1['value']=[i for i in range(1,10)]
df1['square_value']=[i**2 for i in range(1,10)]
df1['cube_value']=[i**3 for i in range(1,10)]
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

- len
- columns
- shape
- datatypes
- head
- tail

In [25]:
df1.columns

Index(['value', 'square_value', 'cube_value'], dtype='object')

In [26]:
list(df1.columns)

['value', 'square_value', 'cube_value']

In [27]:
df1.columns.to_list()

['value', 'square_value', 'cube_value']

In [28]:
df1.shape

(9, 3)

In [29]:
df1.dtypes

value           int64
square_value    int64
cube_value      int64
dtype: object

In [30]:
df.dtypes

Names    object
Age       int64
city     object
age       int64
dtype: object

In [31]:
df1.head()

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125

In [32]:
df1.head(2)

   value  square_value  cube_value
0      1             1           1
1      2             4           8

In [33]:
df1.tail()

   value  square_value  cube_value
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [34]:
len(df1)

9

In [35]:
df1.isnull()
# we are asking a qn
# a null value available or not

   value  square_value  cube_value
0  False         False       False
1  False         False       False
2  False         False       False
3  False         False       False
4  False         False       False
5  False         False       False
6  False         False       False
7  False         False       False
8  False         False       False

In [36]:
df1.isnull().sum()

value           0
square_value    0
cube_value      0
dtype: int64

In [37]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   value         9 non-null      int64
 1   square_value  9 non-null      int64
 2   cube_value    9 non-null      int64
dtypes: int64(3)
memory usage: 348.0 bytes

**step-10**
- how to change a specific value of a column
- df1.drop
 - either it will drop column or index
- df1.rename
 - either it will rename column or index
-df1.replace

In [38]:
df1
#replace cube_value 64 to 464

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [39]:
df1.replace(64,464)

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8           464         512
8      9            81         729

In [40]:
df1.replace(64,464) # all the data will replace
df1.replace({64:464,1:111})# all the data will replace

   value  square_value  cube_value
0    111           111         111
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8           464         512
8      9            81         729

**step-11:selection of a column**

In [41]:
df

    Names  Age  city  age
0  Ramesh   30   Hyd   30
1  Suresh   32  Pune   32
2  Satish   34   Blr   34

In [42]:
df1['cube_value']
#series
#series looks like dataframe
#rows and columns

0      1
1      8
2     27
3     64
4    125
5    216
6    343
7    512
8    729
Name: cube_value, dtype: int64

In [43]:
type(df1)

pandas.core.frame.DataFrame

In [44]:
type(df1['cube_value'])

pandas.core.series.Series

In [45]:
df1.shape  #2dimensional

(9, 3)

In [46]:
df1['cube_value'].shape
#1dimensional data

(9,)

In [47]:
df1[['cube_value']]

   cube_value
0           1
1           8
2          27
3          64
4         125
5         216
6         343
7         512
8         729

In [48]:
df1[['cube_value']]
df1[['cube_value']].shape

(9, 1)

In [49]:
#square_value
#cube_value
#muliple always keeep in list
df1[['cube_value','square_value']]

   cube_value  square_value
0           1             1
1           8             4
2          27             9
3          64            16
4         125            25
5         216            36
6         343            49
7         512            64
8         729            81

In [50]:
df1['cube_value'].replace(64,464,inplace=True)

In [ ]:
df1

**step-12 : how to apppend a row**
- loc
- iloc

In [ ]:
#df1.loc[rows,columns]
#df1.iloc[rows,columns]
#we can select particular rows and columns using a list :[start:stop:step]
df1.iloc[3:7,1:3]
df1.loc[3:7,['square_value','cube_value']]
df1.loc[3:7,['square_value','cube_value']]
cols=['square_value','cube_value']
df1.loc[3:7,cols]

In [ ]:
df1.iloc[[2,3,4,]]
#selecting 3 rows,all the colums
#dataframe

In [ ]:
df1.iloc[[2]]

In [ ]:
df1.iloc[2] #1D series

In [ ]:
df1.iloc[[2,3,4],[0,2]]
#2,3,4 row
#0 and 2nd index

In [ ]:
df1.iloc[2,0]

In [ ]:
df1.iloc[:,0]
#rows and first column

In [ ]:
df1.iloc[2,:]

In [ ]:
df1.iloc[[2],:]

In [ ]:
df1.iloc[2:6,0]

In [ ]:
df1.iloc[2:6,[0]]

In [ ]:
df1.loc[9]=[10,100,1000]

In [ ]:
len(df1)

In [ ]:
ID=len(df1)
df1.loc[ID]=[10,100,1000]
df1

**step-13:save the dataframe**
- We can save dataframes in two ways
-.csv
-.xlsx
- where I want to save : directory
- What the filename to save: filename
- what is the type of a file : Extension
- different folder:"C:\Users\anith\OneDrive\Desktop\Pictures\Documents\Documents\NARESHIT"
- different folder:"C:\Users\anith\OneDrive\Desktop\Pictures\Documents\Documents\NARESHIT"
- same folder:"data1.csv" or "data.xlsx"

In [ ]:

csv_path=r"C:\Users\anith\OneDrive\Desktop\Pictures\Documents\Anitha\data1.csv"
excel_path=r"C:\Users\anith\OneDrive\Desktop\Pictures\Documents\Anitha\data1.xlsx"
df1.to_csv(csv_path)
df1.to_excel(excel_path)

In [ ]:
csv_path=r"data1.csv"
excel_path=r"data1.xlsx"
df1.to_csv(csv_path)
df1.to_excel(excel_path)

**step-14:read the data**

In [56]:
csv_path=r"data1.csv"
pd.read_csv(csv_path)

    value  square_value  cube_value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16          64
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     10           100        1000

In [57]:
excel_path=r"data1.xlsx"
pd.read_excel(excel_path)

    value  square_value  cube_value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16          64
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     10           100        1000

In [ ]:
csv_path=r"data1.csv"
excel_path=r"data1.xlsx"
df1.to_csv(csv_path,index=False)#index column created extra
df1.to_excel(excel_path,index=False)# index column created extra

In [60]:
csv_path=r"data1.csv"
pd.read_csv(csv_path)

    value  square_value  cube_value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16          64
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     10           100        1000